zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hv144k.svd
        <register>
          <name>RES_CAUSE</name>
          <description>Reset Cause Observation Register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0x415B021B</resetMask>
          <fields>
            <field>
              <name>RESET_WDT</name>
              <description>A WatchDog Timer reset has occurred since last power cycle.
This is a high-voltage cause detection, this bit blocks recording of other high-voltage cause bits, except RESET_PORVDDD and XRES.  Hardware clears this bit during POR.  This bit is not blocked by other HV cause bits.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_ACT_FAULT</name>
              <description>Reset caused by the Fault Infrastructure.   This is a low-voltage cause bit that hardware clears when the low-voltage supply is initialized (see comments above).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_PROT_FAULT</name>
              <description>A protection violation occurred that requires a RESET.  This includes, but is not limited to, hitting a debug breakpoint while in Privileged Mode.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_SOFT</name>
              <description>Cortex-M0 requested a system reset through it's SYSRESETREQ.  This can be done via a debugger probe or in firmware.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_CRWDT</name>
              <description>Challenge/Response Watchdog reset.  This is a low-voltage cause bit that hardware clears when the low-voltage supply is initialized (see comments above).</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_XRES</name>
              <description>External XRES pin was asserted.  This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD.  Hardware clears this bit during POR.  This bit is not blocked by other HV cause bits.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_BODVDDD</name>
              <description>Internal VDDD supply crossed brown-out limit. Note that this cause will only be observable as long as the VDDD supply does not go below the POR (power on reset) detection limit. Below this limit it is not possible to reliably retain information in the device. This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD and RESET_XRES. Hardware clears this bit during POR.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_BODVCCD</name>
              <description>Internal VCCD core supply crossed the brown-out limit.  Note that this detector will detect gross issues with the internal core supply, but may not catch all brown-out conditions.  Functional and timing supervision (CSV, WDT) is provided to create fully failsafe internal crash detection.  This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD and RESET_XRES.  Hardware clears this bit during POR.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_OVDVDDD</name>
              <description>Overvoltage detection on the external VDDD supply.  This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD and RESET_XRES.  Hardware clears this bit during POR.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_OVDVCCD</name>
              <description>Overvoltage detection on the internal core VCCD supply.  This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD and RESET_XRES.  Hardware clears this bit during POR.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_BODHVSS</name>
              <description>Internal VDDD supply crossed brown-out limit. Note that this cause will only be observable as long as the VDDD supply does not go below the POR (power on reset) detection limit. Below this limit it is not possible to reliably retain information in the device. This is a high-voltage cause bit that blocks recording of other high-voltage cause bits, except RESET_PORVDDD and RESET_XRES. Hardware clears this bit during POR.  This detector is a backup detector in the high voltage sub-system that is on even in deep sleep.  This detector is used for engineering debug purposes only.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_PORVDDD</name>
              <description>Indicator that a POR occurred.  This is a high-voltage cause bit, and hardware clears the other bits when this one is set.  It does not block further recording of other high-voltage causes.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_PROT</name>
          <description>Register Protection</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF08169E7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAGIC</name>
              <description>Setting this register to the value 0xf08169e7 unlocks access to Lock Protected Registers. These registers can not be written to unless this value has been written into this register. Writing a value OTHER than the magic key will disable access to the registers. The register POR value is set to 'unlock' the register access. 
The registers locked are PWR_CONTROL, PWR_KEY_DELAY, CLK_SELECT, CLK_ILO_CONFIG, CLK_IMO_CONFIG, CRWDT_CTL, CRWDT_EARLY, PWR_SSV_CTL, CRWDT_WARN, CRWDT_LATE, LIFETIME_CTL,HPOSC_CTL(if HPOSC_PRESENT=1), PILO_CTL(if PILO_PRESENT=1), and all trim registers</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRWDT_CTL</name>
          <description>Challenge Response WatchDog Control (Lock Protected)</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC0000000</resetMask>
          <fields>
            <field>
              <name>STATUS_ENABLED</name>
              <description>Indicates actual state of CRWDT enable.  May lag ENABLED by up to one clk_lf cycles.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLED</name>
              <description>When set to '1' enables Challenge/Response WatchDog Timer to Count.  Will require 2 clk_lf cycles to take effect.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRWDT_CHALLENGE</name>
          <description>Challenge Response WatchDog Challenge Value</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CHALLENGE</name>
              <description>Challenge/Response WatchDog Challenge value. Implements the LFSR CCRC8-AutoSar using the polynomial x^8+x^5+x^3+x^2+x+1.  The next value in the LFSR sequence is used to compare against the value subsequently written to the CRWDT_RESPONSE register.  Incremented by write to CRWDT_RESPONSE to LFSR value next in the LFSR sequence after the value written to CRWDT_RESPONSE.  Also incremented each time this register before a response is written to CRWDT_RESPONSE.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRWDT_RESPONSE</name>
          <description>Challenge Response WatchDog Response Value</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>RESPONSE</name>
              <description>Challenge/Response WatchDog Response value.  Value is compared against the expected next value in the LFSR sequence following the value obtained from CRWDT_CHALLENGE.  If the values match, the CRWDT_UPCNT resets. If the values miscompare,  the action selected by CRWDT_CONFIG.CHALLENGE_FAIL_ACTION occurs.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRWDT_UPCNT</name>
          <description>Challenge Response  WatchDog Up Counter</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>UPCNT</name>
              <description>Challenge/Response WatchDog Up Counter.  The counter upcounts upon every clk_lf occurrence when enabled.  If a match occurs between CRWDT_CHALLENGE and CRWDT_RESPONSE, the counter resets.    If there is a mismatch, the action is taken selected by CRWDT_CONFIG.CHALLENGE_FAIL_ACTION.  The counter will also reset when CRWDT_UPCNT=CRWDT_LATE.
CRWDT_CTL.ENABLED=0 - Counter reset
CRWDT_CTL.ENABLED=1 - Counter Increments</description>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRWDT_EARLY</name>
          <description>Challenge Response  WatchDog Early Limit (Lock Protected)</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>EARLY</name>
              <description>Challenge/Response Early Value will cause the action selected by CRWDT_CONFIG.EARLY_ACTION if CRWDT_UPCNT &lt; CRWDT_EARLY and there is a CRWDT_CHALLENGE/CRWDT_RESPONSE match.
Writes to this register are ignored when CRWDT_CTL.ENABLED&lt;&gt;0.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRWDT_WARN</name>
          <description>Challenge Response  WatchDog Warning Limit  (Lock Protected)</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>WARNING</name>
              <description>Challenge/Response Warning Value will cause the action selected by CRWDT_CONFIGWARN_ACTION  if CRWDT_UPCNT&gt;CRWDT_WARN and there is a CRWDT_CHALLENGE/CRWDT_RESPONSE match.  
Writes to this register are ignored when CRWDT_CTL.ENABLED&lt;&gt;0.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRWDT_LATE</name>
          <description>Challenge Response  WatchDog Late Limit  (Lock Protected)</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>LATE</name>
              <description>Challenge/Response Late Value will cause action selected by CRWDT_CONFIG.LATE_ACTION if CRWDT_UPCNT = CRWDT_LATE.   
Writes to this register are ignored when CRWDT_CTL.ENABLED&lt;&gt;0.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRWDT_CONFIG</name>
          <description>Challenge Response WatchDog Configuration</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x810</resetValue>
          <resetMask>0x80000911</resetMask>
          <fields>
            <field>
              <name>EARLY_ACTION</name>
              <description>Action taken if this watchdog when the proper response is written to CRWDT_RESPONSE before CRWDT_UPCNT  reaches CRWDT_EARLY.  EARLY_ACTION is ignored (i.e. treated as NOTHING) when a debugger is connected.
For CRWDT_EARLY  &gt; CRWDT_UPCNT: The action is triggered on same edge as when it meets this condition.
For CRWDT_EARLY &lt;= CRWDT_UPCNT: No action is triggered. 

Writes to this register are ignored when CRWDT_CTL.ENABLED&lt;&gt;0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTHING</name>
                  <description>Do nothing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULT_AND_INT</name>
                  <description>Trigger a Fault and interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LATE_ACTION</name>
              <description>Action taken if this watchdog is not serviced before CRWDT_LATE s reached.  The counter resets CRWDT_UPCNT when CRWDT_LATE is reached, regardless of CRWDT_CONFIG.LATE_ACTION setting.   LATE_ACTION  is ignored (i.e. treated as NOTHING) when a debugger is connected.
For CRWDT_LATE ==  CRWDT_UPCNT: The action is triggered on same edge as when it meets this condition.
For CRWDT_LATE &gt; CRWDT_UPCNT: No action is taken 

Writes to this register are ignored when CRWDT_CTL.ENABLED&lt;&gt;0.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTHING</name>
                  <description>Do nothing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULT_RESET</name>
                  <description>Trigger a fault.  Further, trigger a system-wide reset if the CRWDT is not disabled within 6 clk_lf cycles.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WARN_ACTION</name>
              <description>Action taken if this watchdog when the proper response is written to CRWDT_RESPONSE and  CRWDT_UPCNT  reaches CRWDT_WARN and CRWDT_UPCNT&lt;CRWDT_LATE. WARN_ACTION is ignored (i.e. treated as NOTHING) when a debugger is connected.
For CRWDT_WARN == CRWDT_UPCNT &amp;&amp; CRWDT_LATE &gt; CRWDT_UPCNT: The action is triggered on same edge as when it meets this condition.
For CRWDT_WARN &lt;CRWDT_UPCNT: No action is triggered.

Writes to this register are ignored when CRWDT_CTL.ENABLED&lt;&gt;0.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTHING</name>
                  <description>Do nothing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULT_AND_INT</name>
                  <description>Trigger a Fault and interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHALLENGE_FAIL_ACTION</name>
              <description>Action taken when a failed response occurs, i.e. the expected LFSR value is different than the  expected value.

Writes to this register are ignored when CRWDT_CTL.ENABLED&lt;&gt;0.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTHING</name>
                  <description>Do nothing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Trigger a reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBUG_RUN</name>
              <description>Pauses/runs this counter while a debugger is connected.  Other behaviors are unchanged during debugging, including service, configuration updates and enable/disable.  Note it may take up to two clk_lf cycles for the counter to pause and another two cycles to unpause, due to internal synchronization.  If the debugger is connected for at least two clk_lf cycles, the EARLY_ACTION is ignored until after the first service after the debugger is disconnected.  This prevents an unintentional trigger of the EARLY_ACTION before the firmware realigns the servicing period.  After the first service, EARLY_ACTION behaves as configured.  If the debugger is disconnected before two clk_lf cycles, the EARLY_ACTION may or may not be ignored.
0: When debugger connected, counter pauses incrementing.
1: When debugger connected, counter increments normally, but reset generation is blocked. 

Writes to this register are ignored when CRWDT_CTL.ENABLED&lt;&gt;0.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIFETIME_CTL</name>
          <description>Liftetime Counter Control (Lock Protected)</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC0000007</resetMask>
          <fields>
            <field>
              <name>PRESEL</name>
              <description>Select Divide ratio for Preselector. Legal values are 0-4. Values 5, 6, and 7 yield the same result as  PERSEL_DIV32.  Do not change this setting when lifetime counter is enabled (LIFETIME_CTL.ENABLED=1).  Due to internal synchronization, it takes about 1 LFCLK cycles to update the counters after a write to this register.  This register bit only resets for XRES, POR, or a detected BOD.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRESEL_DIV2</name>
                  <description>Divide CLK_LF by 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESEL_DIV4</name>
                  <description>Divide CLK_LF by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESEL_DIV8</name>
                  <description>Divide CLK_LF by 8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESEL_DIV16</name>
                  <description>Divide CLK_LF by 16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESEL_DIV32</name>
                  <description>Divide CLK_LF by 32</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_ENABLED</name>
              <description>Indicates actual state of lifetime counter enable.  May lag ENABLED by up to one clk_lf cycles.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLED</name>
              <description>When set to '1' enables LIFETIME_COUNTER to increment.   Due to internal synchronization, may take up to one clk_lf cycles to take effect.  The synchronization can be checked by waiting until ENABLED==STATUS_ENABLED whenever ENABLED is changed.  When ENABLE changes from 1-&gt;0, the counter can be loaded with new COUNT value.  Refer to LIFETIME_COUNTER.COUNT for details.  User can enter DeepSleep without waiting for synchronization to complete (ENABLED==STATUS_ENABLED).  This register bit only resets for XRES, POR, or a detected BOD.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIFETIME_WAKEUP</name>
          <description>Lifetime Wakeup Value</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WAKEUP</name>
              <description>Compare the WAKEUP value against LIFETIME_COUNTER. If they are equal interrupt_wakeup to set.   Due to internal synchronization, it may take up to 1 LFCLK cycles to update the counters after a write to this register.  This register bit only resets for XRES, POR, or a detected BOD.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
