zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hv144k.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HVSS</name>
      <description>High Voltage Subsystem</description>
      <baseAddress>0x40060000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>HVREG_STATUS</name>
          <description>HVREG Status</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PWR_GOOD</name>
              <description>High if regulator is settled and operating within normal limits</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HVREG_BIST</name>
          <description>HVREG Bist</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x117</resetMask>
          <fields>
            <field>
              <name>HVREG_ADFT</name>
              <description>Controls ADFT switches</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal operation, amuxbus_a=Z</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS_CIRCUIT_CURRENT_MONITOR</name>
                  <description>Bias current monitor (NMOS drain) on amuxbus_a</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_2</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_3</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_4</name>
                  <description>N/A</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_5</name>
                  <description>N/A</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_6</name>
                  <description>N/A</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD_7</name>
                  <description>N/A</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HVREG_DDFT</name>
              <description>Enable HVREG DDFT outputs to DDFT interface when '1'
(PG on ddft0, '0' on ddft1)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_BURN_IN</name>
              <description>Enable burn-in test mode with Vccd(1.8V) domain</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDIV_CTL</name>
          <description>Resistor Attenuator Control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x37</resetMask>
          <fields>
            <field>
              <name>RDIV_EN_0</name>
              <description>Enable VS0
0=Disabled
1=Enabled during power modes selected by RDIVacten</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDIV_EN_1</name>
              <description>Enable VS1
0=Disabled
1=Enabled during power modes selected by RDIVacten</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDIV_ACT_EN</name>
              <description>Power modes where RDIV is enabled
0=Enable in Active and Deep-Sleep modes
1=Enable in Active mode only</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDIV_SCALE_0</name>
              <description>VS0 attenuation
0=16X attenuation
1=24X attenuation</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDIV_SCALE_1</name>
              <description>VS1 attenuation
0=16X attenuation
1=24X attenuation</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_CTL</name>
          <description>LIN Phy Control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80000117</resetMask>
          <fields>
            <field>
              <name>LIN_MODE</name>
              <description>N/A</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>OFF (TX off, Rx off, Bias Circuits Off), LIN pin recessive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>TX off, RX on, LIN pin recessive (typically used in deep-sleep)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY</name>
                  <description>TX off, RX off, Bias circuits on (faster turn-on, not normally used)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIAGNOSIS</name>
                  <description>TX on, RX on, TX w/weak pull-down (broken wire detect diag)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL_1_0</name>
                  <description>TX on, RX on, 1.0V/us TX edge rate, may not meet all parameters of LIN spec at some operating conditions</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL_1_5</name>
                  <description>TX on, RX on, 1.5V/us TX edge rate, meets all parameters of LIN spec</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL_2_0</name>
                  <description>TX on, RX on, 2.0V/us TX edge rate, may not meet all parameters of LIN spec at some operating conditions</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast mode (non-lin compliant, up to 100kb/s capable)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF_DETECT</name>
              <description>Renamed from SL_ROUND. 0=off; 1=on, reduce impact on LIN driver from incoming EMI.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USE_ALT_INTERFACE</name>
              <description>Selects Primary or Alternate interface for Phy.  The primary use is to enable compliance testing by directly manipulating the Phy interface through GPIOs.
0 = Primary interface (connected to internal LIN controller through HSIOM)
1 = Alternate interface (connected to GPIOs through HSIOM)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LIN_EN</name>
              <description>Master enable of the LIN interface.  
0=Interface is reset and LIN pin is in Hi-Z state
1=Enable the LIN interface</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_TIMER</name>
          <description>LIN Timer Control</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xCFFF0FFF</resetMask>
          <fields>
            <field>
              <name>WAKEUP_TIMER</name>
              <description>Number of LF_CLK edges before wakeup interrupt is triggered</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT_TIMER</name>
              <description>Number of LF_CLK edges before fault interrupt is triggered</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_TIMER_EN</name>
              <description>Wakeup timer is running, required for full LIN compatibility if using Deep-sleep power mode</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT_TIMER_EN</name>
              <description>Dominant state fault timer is running, req'd for full LIN compatibility</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_STATUS</name>
          <description>LIN Status</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>LIN_RXD</name>
              <description>Current state of LIN pin, except in lin_mode 0 or 2, when RXD = 1.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_BIST</name>
          <description>LIN BIST Control</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x37</resetMask>
          <fields>
            <field>
              <name>LIN_ADFT</name>
              <description>Enables Test Modes</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Operation (DFT disabled), amuxbus_a=Z, dft&lt;1:0&gt;=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CURRENT_MONITOR_LWAVE</name>
                  <description>amuxbus_a=Iwave (PMOS drain), dft&lt;1:0&gt;=0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOLTAGE_MONITOR_ERRBUFF</name>
                  <description>amuxbus_a=ErrBuff, dft&lt;1:0&gt;=0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WEAKOUTFET</name>
                  <description>OUTFET = 1/10,  (amuxbus_a=Z, dft&lt;1:0&gt;=0)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CURRENT_MONITOR_FORBIAS_CKT</name>
                  <description>amuxbus_a=Ibias monitor (PMOS drain), dft&lt;1:0&gt;=0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SL_ROUND</name>
                  <description>0=Normal, 1=More moderate (rounded) edge for lower EMI</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDFT_OSC</name>
                  <description>amuxbus_a = Z
dft&lt;1&gt; = LIN_DFT_START,  dft&lt;0&gt; = LIN_OSC</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDFT_DELAY</name>
                  <description>amuxbus_a = Z
dft&lt;1&gt; = LIN_DFT_START,  dft&lt;0&gt; = LIN_DELAY</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LIN_DDFT</name>
              <description>Enable LIN DDFT outputs to DDFT interface
ddft1 = dft&lt;1&gt;, ddft0 = dft&lt;0&gt;</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LIN_DFT_START</name>
              <description>Delay line input</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_INTR</name>
          <description>LIN Interrupt Request Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>WAKEUP</name>
              <description>Master asserted dominant state wakeup (wakeup timer timeout)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT</name>
              <description>Interface asserted state for too long (dominant state timeout)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_INTR_SET</name>
          <description>LIN Interrupt set register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>WAKEUP</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT</name>
              <description>Write with '1' to set corresponding bit in interrupt request register.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_INTR_MASK</name>
          <description>LIN Interrupt mask register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>WAKEUP</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT</name>
              <description>Mask bit for corresponding bit in interrupt request register.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_INTR_MASKED</name>
          <description>LIN Interrupt masked register</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>WAKEUP</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULT</name>
              <description>Logical and of corresponding request and mask bits.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HVSS_DDFT</name>
          <description>HVSS DDFT Control</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>LSOUT_DDFT</name>
              <description>Enable LSOUT DDFT output to DDFT interface
ddft1 = lsout_ddft, ddft0 = 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HVREG_TRIM</name>
          <description>HVREG Trim Settings, first byte</description>
          <addressOffset>0xFF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>TRIM</name>
              <description>N/A</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIN_TRIM</name>
          <description>LIN Trim Settings</description>
          <addressOffset>0xFF04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SLEW_CTL</name>
              <description>N/A</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
