zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hv144k.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PACSS</name>
      <description>Programmable Analog Channel Sub-System</description>
      <baseAddress>0x40300000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>1048576</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>4</dim>
          <dimIncrement>65536</dimIncrement>
          <name>DCHAN[%s]</name>
          <description>Digital Channel Configuration</description>
          <addressOffset>0x00000000</addressOffset>
          <register>
            <name>DCHAN_CTL</name>
            <description>Digital Channel Control</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xF0</resetValue>
            <resetMask>0xC00003F7</resetMask>
            <fields>
              <field>
                <name>AGC_GAIN_EN</name>
                <description>AGC Gain Enable 

0 - Digital channel uses gain values from dchan configuration
1 - Digital channel uses gain values provided from AGC</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PP_EN</name>
                <description>Post Processor Enable

Enables all features of the post processor including the accumulated result register. When disabled the post processor is bypassed.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FIR_EN</name>
                <description>FIR Enable

0 - Disabled
1 - Enabled</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FIR_NUM_TAPS</name>
                <description>FIR number of Taps.

FIR_NUM_TAPS + 1 equals the numbers of Taps enabled in the FIR Filter</description>
                <bitRange>[9:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SEC_EN</name>
                <description>Secondary Channel Enable

Use case is for diagnostic or temperature measurements. When a digital channel is set as secondary, when it is triggered, by a secondary trigger, the conversion of the channel pends until the next primary conversion completes. Secondary channels should always have a higher dchan index than the enabled primary channels associated with the same analog channel (ACHAN).  For example if both dchan0 and dchan1 are  using achan0, then dchan0 should never be set as a secondary channel.
 
0 - digital channel is configured as primary channel 
1 - digital channel is configured as secondary channel</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Enable Digital Channel</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SMP_CTL</name>
            <description>Sample Control</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7FFDF7F1</resetMask>
            <fields>
              <field>
                <name>ACHAN_SEL</name>
                <description>Analog Channel Selection

Select which analog to use with this digital channel.

 0 - Analog Channel 0
 1 - Analog Channel 1</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>POS_PIN_SEL</name>
                <description>Positive Pin Select ( Sequencer controlled)</description>
                <bitRange>[10:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>NEG_PIN_SEL</name>
                <description>Negative Pin Select</description>
                <bitRange>[16:12]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA</name>
                    <description>0x00 - vssa</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K0</name>
                    <description>0x08 - vssa_k0, unused (floating)</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K1</name>
                    <description>0x09 - vssa_k1, vrefl</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K2</name>
                    <description>0x0A - vssa_k2, srss_vss</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K3</name>
                    <description>0x0B - vssa_k3, vdiv_ret</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K4</name>
                    <description>0x0C - vssa_k4, vts_ret</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K5</name>
                    <description>0x0D - vssa_k5, vtint_ret</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K6</name>
                    <description>0x0E - vssa_k6, gpio0</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_VSSA_K7</name>
                    <description>0x0F - vssa_k7, gpio2</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_RSL0</name>
                    <description>0x10 - rsl0</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_RSL1</name>
                    <description>0x18 - rsl1</description>
                    <value>24</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_AMUXA</name>
                    <description>0x1A - amuxbusa, if selected pos_pin_sel should be set to amuxbusb</description>
                    <value>26</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG_PIN_SEL_AMUXB</name>
                    <description>0x1B - amuxbusb, if selected pos_pin_sel should be set to amuxbusa</description>
                    <value>27</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BYPASS_AAF</name>
                <description>Bypass the Anti-Aliasing Filter

Open SW1, SW2, SW4, and close SW3 of the AAF during this channels conversion</description>
                <bitRange>[18:18]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AAF_SHORT_R_EN</name>
                <description>Automatically short the Anti-Aliasing Filter  resistor during the channel selection delay. The expectation is that his will decrease the required settling time. Has no affect if BYPASS_AAF=1</description>
                <bitRange>[19:19]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CH_SEL_DLY</name>
                <description>Channel Selection Delay. The value written to this field,  plus 1, is the number of DSM clock cycles that will be inserted after the virtual channel configuration is loaded and before the decimator is started. Ex: write 7 for 8 clock cycles.</description>
                <bitRange>[27:20]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AVG_MODE</name>
                <description>N/A</description>
                <bitRange>[29:28]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MOV_SUM</name>
                <description>Moving Sum

