zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hv144k.svd
0 - Off
1 - When AVG_MODE is enabled, no right shift occurs to divided result.
Ex. If AVG_MODE=1 then the result is the sum of the last two samples. This register takes no affect when AVG_MODE=0.</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SMP_REF_CTL</name>
            <description>Sample Reference Control</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x70137</resetMask>
            <fields>
              <field>
                <name>VREFH_SEL</name>
                <description>VREFH selection</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VREFH_SEL_VREFH_DIRECT</name>
                    <description>VREFH Direct (HPBGR)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH_SEL_VREFH_BUFFERED</name>
                    <description>VREFH Buffered (HPBGR)</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH_SEL_SRSS</name>
                    <description>VREF SRSS</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH_SEL_VTS_REF</name>
                    <description>VTS_REF</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH_SEL_VDDA_DIV4</name>
                    <description>VDDA/4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREF_HSEL_VDDA_DIV3</name>
                    <description>VDDA/3</description>
                    <value>5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VREFL_SEL</name>
                <description>VREFL selection</description>
                <bitRange>[5:4]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VREFL_SEL_VREFL</name>
                    <description>VREFL</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFL_SEL_VSSA_SRSS</name>
                    <description>VSSA_SRSS</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFL_SEL_VSSA_KELVIN</name>
                    <description>VSSA_KELVIN</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFL_SEL_VTS_RET</name>
                    <description>VTS_RET</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VREF_BUF_EN</name>
                <description>VREF Buffer Enable

VREF_BUF_EN should only be used when a reference other than the default reference (HPBGR 0.1 percent reference) is used.  When the HPBGR reference is used, the reference is provided directly from the HPBGR with the help from external cap for the transients.

If this bit is set on a secondary channel, vref_buf_en for the assigned analog channel will be set once the secondary channel is pended to allow enough ramp up time of the VREFH buffer so that it is ready to sample once the secondary channel is ready to convert. The required ramp-up time of the VREFH buffer is 6 us, it is on the user to ensure the secondary channel is pended early enough to ensure this ramp-up time if the associated primary channel does not have this bit set.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RS_PULLUP_SEL</name>
                <description>Resistor Pull-up Select

Based on the selection, the pin is pulled-up to VDDA via 4k-ohm (typ) resistor for open wire detection.</description>
                <bitRange>[17:16]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RS_PULLUP_SEL_RSH1</name>
                    <description>RSH[1] Pull-up Selected</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RS_PULLUP_SEL_RSH0</name>
                    <description>RSH[0] Pull-up Selected</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RS_PULLUP_SEL_RSL1</name>
                    <description>RSL[1] Pull-up Selected</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RS_PULLUP_SEL_RSL0</name>
                    <description>RSL[0] Pull-up Selected</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RS_PULLUP_EN</name>
                <description>Resistor Pull-up Enable</description>
                <bitRange>[18:18]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DEC_CTL</name>
            <description>Decimator Control</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x53F0</resetValue>
            <resetMask>0xFFF1FFFF</resetMask>
            <fields>
              <field>
                <name>SINC_MODE</name>
                <description>Decimator Sinc Mode

0 - Sinc3, Decimator is configured as a 3-state CIC decimation filter
1 - Sinc4, Decimator is configured as a 4-stage CIC decimation filter</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CONV_MODE</name>
                <description>Conversion Mode

0 - Incremental (Single Sample)
1 - Continuous

