zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hv144k.svd
This bit can be cleared during a continuous conversion to end the sample.

In the expected use case: Primary channels should use Continuous, while secondary channels should be set to Incremental.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OCOR_EN</name>
                <description>Offset Correction Enable

This bit controls the offset correction feature of the Decimator filter.  The offset value is programmed in the OCOR bits of the OFST_COR register. Conversion results are unpredictable if this bit is changed while the filter is running.

This must be set to use DCHAN.OFST_COR or GAIN_LVL_STRUCT.OFST_COR, which one it chooses is based on DCHAN_CTL.AGC_GAIN_EN.

If OCOR_EN and GCOR_EN are both disabled this prevents the capability to loop back the data valid HW trigger of this channel and use it as the conversion start HW trigger of this channel. If either GCOR or OCOR is enabled this is allowed.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>GCOR_EN</name>
                <description>Gain Correction Enable

This bit controls the gain correction feature of the Decimator filter. The gain coefficient is programmed in the GCOR bits of the GAIN_COR register. Which bits in this 16-bit field that are valid is set in GVAL. Conversion results are unpredictable if this bit is changed while the filter is running. When this feature is enabled, the DR register field must be set to a value higher than 32 (worst case) for proper operation. See the DR register definition of cases where values less than 32 are allowed.

This must be set to use DCHAN.GAIN_COR or GAIN_LVL_STRUCT.GAIN_COR.  
The value chosen, is based on DCHAN_CTL.AGC_GAIN_EN

If OCOR_EN and GCOR_EN are both disabled this prevents the capability to loop back the data valid HW trigger of this channel and use it as the conversion start HW trigger of this channel. If either GCOR or OCOR is enabled this is allowed.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DR</name>
                <description>Decimation Ratio

DR is an 7-bit field that sets the decimation ratio (DR+1) in the  sinc3/sinc4 CIC filter.  The decimation ratio minus one is the value that is programmed into this register.

Changing this field during a conversion will disrupt the output value. Conversion results are unpredictable if these bits are changed while the filter is running.

The suggested minimum value of DR is 0x3F. 
If a lower value is required, the minimum DR is determined by GVAL if gain is enabled.

DR &gt; (GCOR_COR.GVAL) * 2 when GCOR_EN is set to 1.

An example of some acceptable values for DR/DR2:

Data Rate:           DR+1:          DR2+1: 
 48ksps                   64                 1
   8ksps                   64                 6
   4ksps                  128                6
   2ksps                  128               12
   1ksps                  128               24</description>
                <bitRange>[10:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SAT_EN</name>
                <description>Saturation Enable

Controls saturation logic in the Decimator. When enabled, gain and offset calculations are held to the most positive or negative values, rather then wrapping around. Conversion results are unpredictable if this bit is changed while during a conversion. This bit is ignored if OCOR_EN and GCOR_EN are all 0. This feature is used to prevent wrap-around if the decimator is incorrectly configured. This bit should be set to 1 if OCOR_EN or GCOR_EN is set to 1.</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DR2</name>
                <description>Decimation Ratio 2 

DR2 is a 5-bit field that sets the decimation ratio (DR2+1) of the sinc2 rate reducer within the Decimator. The decimation ratio of the rate reducer minus one is the value that is programmed into this register. This field should not be changed during a conversion.

DR2 must be less than DR/2.

An example of some acceptable values for DR/DR2:

Data Rate:           DR+1:          DR2+1: 
 48ksps                   64                 1
   8ksps                   64                 6
   4ksps                  128                6
   2ksps                  128               12
   1ksps                  128               24</description>
                <bitRange>[16:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SHIFTL</name>
                <description>Shift Left (Scaler)

Value for left shift amount of modulator input data. Supported values are 0 - 9. Using values 10-15 may result in a loss of data

This register provides control information to the input (left) shifter. SHIFTL is a 4-bit field that sets the amount of left shift that the Modulator input will be shifted. Disturbing this field during a conversion will disturb the output value. This register should only be updated while the CIC filter is in the Standby state. Conversion results are unpredictable if these bits are changed while the filter is running. A read of this register produces the last value written to this register.

This value is overridden by the Gain Level setting when DCHAN_CTL.AGC_GAIN_EN=1</description>
                <bitRange>[23:20]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DEC_SHIFTR</name>
                <description>Decimator Output Right Shift

The maximum data path of the sinc4 filter is 42-bits. This shift register is used to align the resolution down to 32-bits,  otherwise the MSB bits will be truncated. 

To avoid truncation of relevant bits, the min value for this register should be:
log2(qlev) + max(SHIFTL) + N*log2(DR +1) - (32 - log2(U))

Where U = 1 for moving sum disabled, 2 for moving sum with avg mode=2 samples, and 4 for moving sum w/ avg mode =4 samples

where N = # of sinc stages (either 3 or 4 depending on sinc_mode field).
In the equation above DR and DR2 are the values used in register programming (decimation ratios minus one)</description>
                <bitRange>[27:24]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RR_SHIFTR</name>
                <description>Rate Reducer Output Right Shift

The maximum data path of the sinc2 rate reducer filter is 42-bits . This shift register is used to align the resolution down to 32-bits, otherwise the MSB bits will be truncated.

To avoid truncation of relevant bits, the min value for this register should be:
log2(qlev) + max(SHIFTL) + N*log2(DR +1)  +2*log2(DR2+1) - DEC_SHIFTR - (32 - log2(U))

Where U = 1 for moving sum disabled, 2 for moving sum with avg mode=2 samples, and 4 for moving sum w/ avg mode =4 samples

where  DR2 is the values used in register programming (decimation ratios minus one)</description>
                <bitRange>[31:28]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PP_CTL</name>
            <description>Post Processing Control</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x4000000</resetValue>
            <resetMask>0xFF33010F</resetMask>
            <fields>
              <field>
                <name>PP_SHIFTR</name>
                <description>Post Processor Right Shift

