zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hv144k.svd
Value for the amount of right shift for the input of the post processor (output of the FIR filter). The right shift operation is the first Post Processor operation. Processor. Functional values range from 0 to 15, 0 = no shift. This shift value will be based on the values of the FIR coefficients and the number of FIR taps. If the FIR is disabled, this value can be 0.

If the FIR is enabled this shift value can be calculated by using the following:

datapath bandwith:
dp_bw =  log2(qlev) + max(SHIFTL) + N*log2(DR +1)  +2*log2(DR2+1) - DEC_SHIFTR - RR_SHIFTR

FIR datapath adjustment:
fir_dp_adj  = log2(coeff[0] + coeff[1] + ... + coeff[n])

pp_shiftr =  dp_bw + fir_adj -32</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CLAMP</name>
                <description>Clamp

0 - Disabled (32-bit result)
1 - Clamps Result Data to 24-bits

When enabled the max positive value will be clamped to 0x7FFFFF and the max negative value will be clamped to 0x800000.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RANGE_DET_EN</name>
                <description>N/A</description>
                <bitRange>[17:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RANGE_COND</name>
                <description>Range Condition Select

0  - result &lt; RANGE_LOW
1 - RANGE_LOW &lt;= result &lt; RANGE_HIGH
2 - RANGE_HIGH &lt;= result
3 - result &lt; RANGE_LOW || RANGE_HIGH &lt;= result</description>
                <bitRange>[21:20]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RANGE_CNT_VAL</name>
                <description>Range Detection Count Value

This register limits RANGE_INTR from asserting unless enough range detections have occurred. It is only used when  RANGE_DET_EN=2'b10 mode. The range detection  counter increments when a sample meets the range condition and decrements otherwise. When the range detection counter matches the RANGE_CNT_VAL the RANGE_INTR is asserted.</description>
                <bitRange>[31:24]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OFST_COR</name>
            <description>Offset Correction register</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFF</resetMask>
            <fields>
              <field>
                <name>OCOR</name>
                <description>Decimator Offset Correction Coefficient

OCOR is a 16-bit 2's compliment signed field that is the offset correction value used if the decimator Offset feature is enabled. This register may be written while the filter is running. 

OCOR&lt;&lt;OCOR_SCLR will be added to the decimation result.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OCOR_SCLR</name>
                <description>Decimator Offset Correction Coefficient Scaler

OCOR_SCLR is the left shift amount to where the OCOR is applied to the decimation result. OCOR &lt;&lt; OCOR_SCLR will be added to the decimation result.</description>
                <bitRange>[19:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAIN_COR</name>
            <description>Gain Correction register</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xF0000</resetValue>
            <resetMask>0xFFFFF</resetMask>
            <fields>
              <field>
                <name>GCOR</name>
                <description>Decimator Gain Correction Coefficient</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>GVAL</name>
                <description>Number of valid bits minus one in Gain Coefficient registers GCOR

GVAL is a 4-bit field that signifies to the HW how many bits of GCOR field are valid. The number of valid bits minus one should be written (0000b = 1 bit, 1111b = all 16 bits). Updates to this register will be ignored until the start of the next multiply. This register may be written while the filter is running. The valid field is measured from LSB (bit 0) up. Note that the HW always assumes the field specified by GVAL is left justified (starts at bit 0 of GCOR) and has a binary-point after the left-most digit. For example, if GVAL is programmed with a 7d, this means there are 8 valid bits in GCOR and they have the format x.xxxxxxxb. If GCOR holds the value 00000000 10100000b and GVAL is 7, only the low-order 8 bits are considered (10100000b) and the binary point is assumed after the left-most digit (1.0100000b). The multiply coefficient in the example would be 1.25d. Although a good explanation example, this isn't the most efficient way to multiply by 1.25d. Better would be GCOR holds the value 00000000 00000101b and GVAL is 2, which gives (1.01b). Another example: If it is desired to multiply by a gain coefficient of 0.125d (0.001b) then GCOR would be programmed with a value of 00000001b, GCORH with 00000000b and GVAL (GVAL) with 0011b - meaning there are 4 valid bits x.xxxb. The multiplier thus has a coefficient range of 1/(2^15) to 2.0-(1/(2^15)) in steps of 1/(2^15)</description>
                <bitRange>[19:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RANGE_LOW</name>
            <description>Range Detect low value register.</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RANGE_LOW</name>
                <description>Low threshold for range detect</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RANGE_HIGH</name>
            <description>Range detect high value register.</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x7FFFFFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RANGE_HIGH</name>
                <description>High threshold for range detect</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PGA_GAIN_CTL</name>
            <description>PGA Gain Control register</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>GAIN</name>
                <description>PGA Gain setting of 1,2,4,8,16, 32 are supported

This gain setting is overridden by AGC values if PACSS_CTL.AGC_EN=1 and DCHAN_CTL.AGC_GAIN_EN=1. Therefore the current value of the PGA gain can not be read from this register during AGC mode</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GAIN_1X</name>
                    <description>1x</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GAIN_2X</name>
                    <description>2x</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GAIN_4X</name>
                    <description>4x</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GAIN_8X</name>
                    <description>8x</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GAIN_16X</name>
                    <description>16x</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GAIN_32X</name>
                    <description>32x</description>
                    <value>5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CAP_CFG0</name>
            <description>Capacitor Configuration 0 register</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x70F0F07F</resetMask>
            <fields>
              <field>
                <name>FCAP1</name>
                <description>binary weighted first stage integrating capacitance</description>
                <bitRange>[6:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FCAP2</name>
                <description>The second state integrating capacitance</description>
                <bitRange>[15:12]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FCAP2_50fF</name>
                    <description>50fF</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP2_100fF</name>
                    <description>100fF</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP2_150fF</name>
                    <description>150fF</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP2_200fF</name>
                    <description>200fF</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP2_250fF</name>
                    <description>250fF</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP2_300fF</name>
                    <description>300fF</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP2_350fF</name>
                    <description>350fF</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP2_400fF</name>
                    <description>400fF</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP2_450fF</name>
                    <description>450fF</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP2_500fF</name>
                    <description>500fF</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP2_550fF</name>
                    <description>550fF</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP2_600fF</name>
                    <description>600fF</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP2_650fF</name>
                    <description>650fF</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP2_700fF</name>
                    <description>700fF</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP2_750fF</name>
                    <description>750fF</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP2_800fF</name>
                    <description>800fF</description>
                    <value>15</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FCAP3</name>
                <description>The third stage integrating capacitance</description>
                <bitRange>[23:20]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FCAP3_100fF</name>
                    <description>100fF</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP3_200fF</name>
                    <description>200fF</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP3_300fF</name>
                    <description>300fF</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP3_400fF</name>
                    <description>400fF</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP3_500fF</name>
                    <description>500fF</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP3_600fF</name>
                    <description>600fF</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP3_700fF</name>
                    <description>700fF</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP3_800fF</name>
                    <description>800fF</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP3_900fF</name>
                    <description>900fF</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP3_1000fF</name>
                    <description>1000fF</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP3_1100fF</name>
                    <description>1100fF</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP3_1200fF</name>
                    <description>1200fF</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP3_1300fF</name>
                    <description>1300fF</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP3_1400fF</name>
                    <description>1400fF</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP3_1500fF</name>
                    <description>1500fF</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCAP3_1600fF</name>
                    <description>1600fF</description>
                    <value>15</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESCAP</name>
                <description>N/A</description>
                <bitRange>[30:28]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
