zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hv144k.svd
          <register>
            <name>CAP_CFG1</name>
            <description>Capacitor Configuration 1 register</description>
            <addressOffset>0x2C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7703F3F</resetMask>
            <fields>
              <field>
                <name>DACCAP</name>
                <description>Binary weighted first stage DAC capacitance</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DACCAP_min</name>
                    <description>Min Value = 96 fF</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DACCAP_max</name>
                    <description>Max Value = 6.4 pF</description>
                    <value>63</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DACCAP_96fF</name>
                    <description>DACCAP[0] set -&gt; add 12*8= +96 fF</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DACCAP_192fF</name>
                    <description>DACCAP[1] set -&gt; add 24*8= +192 fF</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DACCAP_400fF</name>
                    <description>DACCAP[2] set -&gt; add 50*8= +400 fF</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DACCAP_800fF</name>
                    <description>DACCAP[3] set -&gt; add 100*8= +800 fF</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DACCAP_1600fF</name>
                    <description>DACCAP[4] set -&gt; add 200*8= +1600 fF</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DACCAP_3200fF</name>
                    <description>DACCAP[5] set -&gt; add 400*8= +3200 fF</description>
                    <value>32</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IPCAP1</name>
                <description>Binary weighted first stage input sampling capacitance</description>
                <bitRange>[13:8]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>IPCAP1_min</name>
                    <description>Min Value = 100 fF</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP1_max</name>
                    <description>Max Value = 6.4 pF</description>
                    <value>63</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP1_100fF</name>
                    <description>IPCAP1[0] set -&gt; +100 fF</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP1_200fF</name>
                    <description>IPCAP1[1] set -&gt; +200 fF</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP1_400fF</name>
                    <description>IPCAP1[2] set -&gt; +400 fF</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP1_80fF</name>
                    <description>IPCAP1[3] set -&gt; +800 fF</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP1_1600fF</name>
                    <description>IPCAP1[4] set -&gt; +1600 fF</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP1_3200fF</name>
                    <description>IPCAP1[5] set -&gt; +3200 fF</description>
                    <value>32</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IPCAP2</name>
                <description>Binary weighted second stage input sampling capacitance</description>
                <bitRange>[22:20]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>IPCAP2_50fF</name>
                    <description>50fF</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP2_100fF</name>
                    <description>100fF</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP2_150fF</name>
                    <description>150fF</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP2_200fF</name>
                    <description>200fF</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP2_250fF</name>
                    <description>250fF</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP2_300fF</name>
                    <description>300fF</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP2_350fF</name>
                    <description>350fF</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP2_400fF</name>
                    <description>400fF</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IPCAP3</name>
                <description>Binary weighted third stage input sampling capacitance</description>
                <bitRange>[26:24]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>IPCAP3_50fF</name>
                    <description>50fF</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP3_100fF</name>
                    <description>100fF</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP3_150fF</name>
                    <description>150fF</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP3_200fF</name>
                    <description>200fF</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP3_250fF</name>
                    <description>250fF</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP3_300fF</name>
                    <description>300fF</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP3_350fF</name>
                    <description>350fF</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPCAP3_400fF</name>
                    <description>400fF</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
