zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hv144k.svd
This field can be used as a sequence ID, this field increments for every valid sample For example if moving average is enabled and set to 4. SMP_COUNT will equal one on the fourth sample, which will be the first data valid (interrupt). If moving average is disabled, the first sample will be valid. This value is set simultaneously with the result data. The count value is reset with PACSS_MMIO.PACSS_CTL.ENABLE=0 or DCHAN.DCHAN_CTL.ENABLE=0.</description>
                <bitRange>[13:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DCH_ID</name>
                <description>Digital Channel ID

This field is a constant value of the digital channel(DCHAN) number this register is read from. The DCH_ID will be set immediately, before any sample completes.</description>
                <bitRange>[17:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DATA_TYPE</name>
                <description>Result Data Type

Represents the value of PACSS.DCHAN[]_SMP_CTL.POS_PIN_SEL.DATA_TYPE used during the conversion. Note that the DATA_TYPE is latched at the start of the conversion to ensure a constant input selection during the conversion, but is updated here at the end of conversion simultaneously with the RESULT register and the other RESULT_TAG fields.</description>
                <bitRange>[26:20]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ACC_RESULT</name>
            <description>Channel Accumulated result data register</description>
            <addressOffset>0x48</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ACC_RESULT</name>
                <description>Accumulator Output result register. Write '0s' to clear. This register will only be updated if the post processor is enabled. This register must be manually cleared, it is not cleared after ACC_THRESH_INTR.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR</name>
            <description>Interrupt request register</description>
            <addressOffset>0x50</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>DATA_VAL_INTR</name>
                <description>Data Valid Interrupt 0: hardware sets this interrupt after completing a scan of all the enabled channels. Write with '1' to clear bit.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERFLOW_INTR</name>
                <description>Overflow Interrupt: hardware sets this interrupt when it sets a new DATA_VAL_INTR while that bit was not yet cleared by the firmware. Write with '1' to clear bit.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FWT_COLLISION_INTR</name>
                <description>Firmware Trigger Collision Interrupt 0: hardware sets this interrupt when FW_TRIGGER is asserted while the DSM is BUSY. Raising this interrupt is delayed to when the scan caused by the FW_TRIGGER has been completed, i.e. not when the preceding scan with which this trigger collided is completed. When this interrupt is set it implies that the channels were sampled later than was intended (jitter). Write with '1' to clear bit.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HWT_COLLISION_INTR</name>
                <description>Hardware Trigger Collision Interrupt 0: hardware sets this interrupt when the HW trigger signal is asserted while the DSM is BUSY. Raising this interrupt is delayed to when the scan caused by the HW trigger has been completed, i.e. not when the preceding scan with which this trigger collided is completed. When this interrupt is set it implies that the channels were sampled later than was intended (jitter). Write with '1' to clear bit.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERLOAD_INTR</name>
                <description>Overload Interrupt: hardware sets this interrupt for each channel if the modulator output is all zeros or all ones. This is an indication that the modulator is overloaded. Write with '1' to clear bit.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SATURATE_INTR</name>
                <description>Saturate Interrupt: hardware sets this interrupt  if a conversion result is prevented from overflowing in either the decimator or the post processor when PP_CTL.SAT_EN=1. Write with '1' to clear bit.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ACC_THRESH_INTR</name>
                <description>Accumulated Threshold Interrupt: hardware sets this interrupt when the accumulated threshold value has been surpassed.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RANGE_INTR</name>
                <description>Range detect Interrupt: hardware sets this interrupt if the conversion result of that channel met the condition specified by the RANGE_LOW and RANGE_HIGH registers. Write with '1' to clear bit.</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_SET</name>
            <description>Interrupt set request register</description>
            <addressOffset>0x54</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>DATA_VAL_SET</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERFLOW_SET</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FWT_COLLISION_SET</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HWT_COLLISION_SET</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERLOAD_SET</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SATURATE_SET</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ACC_THRESH_SET</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RANGE_SET</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASK</name>
            <description>Interrupt mask register</description>
            <addressOffset>0x58</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>DATA_VAL_MASK</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERFLOW_MASK</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FWT_COLLISION_MASK</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HWT_COLLISION_MASK</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERLOAD_MASK</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SATURATE_MASK</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ACC_THRESH_MASK</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RANGE_MASK</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASKED</name>
            <description>Interrupt masked request register</description>
            <addressOffset>0x5C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>DATA_VAL_MASKED</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>OVERFLOW_MASKED</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>FWT_COLLISION_MASKED</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HWT_COLLISION_MASKED</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>OVERLOAD_MASKED</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SATURATE_MASKED</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ACC_THRESH_MASKED</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RANGE_MASKED</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[7:7]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status registesr</description>
            <addressOffset>0x60</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>OVERLOAD_CAUSE</name>
                <description>To be read after OVERLOAD_INTR issues. If read returns 0, overload is due to all 0s. If read returns 1, overload is due to all 1s</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>64</dim>
            <dimIncrement>16</dimIncrement>
            <name>FCFG[%s]</name>
            <description>FIR Configuration</description>
            <addressOffset>0x00000100</addressOffset>
            <register>
              <name>COEF</name>
              <description>Coefficient Value</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x0</resetMask>
              <fields>
                <field>
                  <name>COEF</name>
                  <description>FIR Coefficient Value

The coefficient values can range from -1+1/(2^15) to 1-1/(2^15) with a resolution of 1/(2^15). The coefficient uses twos-complement notation and the decimal point is fixed to the right of the most significant bit.

Examples: -0.25 = 0xE000 and 0.25 = 0x2000

Note: The Coefficient values are stored in SRAM, not registers. They are not initialized during a reset.  They also cannot be accessed during a conversion.</description>
                  <bitRange>[15:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>TAP</name>
              <description>Tap Value</description>
              <addressOffset>0x8</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x0</resetMask>
              <fields>
                <field>
                  <name>TAP</name>
                  <description>Tap value, Witten by hardware readable by software. 

Note: The TAP values are stored in SRAM, not registers. They are not initialized during a reset.  They also cannot be accessed during a conversion.</description>
                  <bitRange>[31:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>65536</dimIncrement>
          <name>ACHAN[%s]</name>
          <description>Analog Channel Configuration</description>
          <addressOffset>0x00040000</addressOffset>
          <register>
            <name>ACHAN_CTL</name>
            <description>Analog Channel Control</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x8003070F</resetMask>
            <fields>
              <field>
                <name>MOD_EN</name>
                <description>Modulator Enable (also enables INMUX)</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PGA_EN</name>
                <description>Programmable Gain Amplifier Enable  (also enables VNEG Pump)</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUF_EN</name>
                <description>Buffer Enable

Enables the buffer, when disabled all buffer controls from BUF_CTL are disabled.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REF_EN</name>
                <description>Reference Enable

It enables the *_SEL controls in the REF_CTL registers, which allows switch closure for the reference selection.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VCCA_RES_EN</name>
                <description>VCCA Resistor Reference Enable

This is one of the options for the VCM voltage.  The default is 0.8V from HPBGR.  This is added for risk-mitigation.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VDDA_RES_EN</name>
                <description>VDDA Resistor Reference Enable 

