zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hv144k.svd
This is one of the reference options for the modulator.  It is meant to be used for diagnostics.</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VCM_BUF_EN</name>
                <description>VCM Buffer Enable

VCM_BUF is the buffer that provides the common mode for the differential amplifiers in the modulator.  It also provides input common mode to the sampling capacitor of the integrators.</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AAF_CUTOFF_FREQ</name>
                <description>N/A</description>
                <bitRange>[17:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Analog Channel Enable</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TR_CTL</name>
            <description>Trigger Control for Sequencer</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x44</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>PRIM_TR_SEL</name>
                <description>Select for Primary Trigger. Triggers starts conversion on all  primary digital channels linked  to this analog channel.

0 - select HW tr_start[0]
1 - select HW tr_start[1]
2 - select HW tr_start[2]
3 - select HW tr_start[3]

Only applicable to HW triggers</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SYNC_PRIM_TR</name>
                <description>Synchronize Primary Trigger

0 -  bypass clock domain synchronization of the trigger signal.
1 - synchronize the trigger signal to the DSM clock domain, if needed an edge detect is done in the peripheral clock domain.

Only applicable to HW triggers</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIM_TR_EN</name>
                <description>Primary Trigger Enable  (enables HW triggers)

if disabled, conversion can still be started via user SW</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PEND_SEC_TR_SEL</name>
                <description>Select for Trigger that pends secondary digital channels linked to this analog channel to convert on the next primary trigger.

0 - select HW tr_start[0]
1 - select HW tr_start[1]
2 - select HW tr_start[2]
3 - select HW tr_start[3]

Only applicable to HW triggers</description>
                <bitRange>[5:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SYNC_SEC_TR</name>
                <description>Synchronize Secondary Trigger

0 -  bypass clock domain synchronization of the trigger signal.
1 - synchronize the trigger signal to the DSM clock domain, if needed an edge detect is done in the peripheral clock domain.

Only applicable to HW triggers</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PEND_SEC_TR_EN</name>
                <description>Secondary Trigger Enable  (enables HW triggers)

if disabled, conversion can still be pended via user SW</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CHOP_CTL</name>
            <description>Chopping Control for Sequencer</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x60000000</resetValue>
            <resetMask>0xF3FFFF0F</resetMask>
            <fields>
              <field>
                <name>SMP_CNT</name>
                <description>Chopping Sample Count

Number of samples to count before toggling modbit. (SMP_CNT+1). The samples counted rely only on the DR value set in DEC_CTL or SEQ_CTL. Depending on which one the Decimator is using.</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AAF_SHORT_R_CNT</name>
                <description>Anti-Aliasing Filter Short Resistor Count

Number of DSM clock cycles (AAF_SHORT_CNT) to short the AAF resistor after a toggle of the  modbit.</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DEC_BLANK_CNT</name>
                <description>Decimator Blanking Count

Number of DSM clock cycles (DEC_BLANK_CNT) where the decimator will be disconnected from the modulator output stream, and connected to a circular FIFO of the last 32 data values after the modbit toggles</description>
                <bitRange>[23:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CHOP_MODE</name>
                <description>Chopping Mode

00 - OFF:  Buffer Cross Chopping Disabled
01 - Not supported
11 - Buffer Cross Chopping Enabled
10 - Not supported

Buffer cross chopping is on the input and  output of the buffer using the modbit. This mode toggles the modbit when the SMP_CNT value is reached.

Buffer cross chopping is only functional in the configurations where ACHAN0 is only mapped to DCHAN0, or ACHAN1 (if present) is only mapped to DCHAN1 (if present).</description>
                <bitRange>[25:24]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CIRCUIT_CHOP</name>
                <description>Circuit Chopping 

