zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hv144k.svd
0 - Off
1 - Disconnect AAF (SW1) for 1 DSM clock cycle after fchop clock edge
2 - Disconnect AAF (SW1) for 2 DSM clock cycle after fchop clock edge
3 - Disconnect AAF (SW1) for 4 DSM clock cycle after fchop clock edge

Circuit chopping differs from the other fields in this register, it has no interaction with the modbit. When enabled it disconnects the AAF for the set number of clock cycles after a fchop clock edge.</description>
                <bitRange>[29:28]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CIRCUIT_2ND_EN</name>
                <description>2nd Stage Circuit Chopping Enable

Enables Circuit Chopping on the 2nd integrator in the modulator</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CHOP_RST_EN</name>
                <description>N/A</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PGA_CTL</name>
            <description>Programmable Gain Amplifier Control</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x133</resetValue>
            <resetMask>0x733</resetMask>
            <fields>
              <field>
                <name>PGA_PWR_LEVELS</name>
                <description>PGA Power Levels

00 - 39 percent Power Mode
01 - 58 percent Power Mode
10 - 78 percent Power Mode
11 - 100 percent Power Mode</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PGA_CHOP_EN</name>
                <description>Chopping Enable</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PGA_IDAC_EN</name>
                <description>IDAC Enable</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PGA_OVERLAP_EN</name>
                <description>PGA Overlap Enable

Enable overlapping for the PGA chopping clocks.  When disabled, PGA chopping clocks are non-overlapping</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PGA_DYN_DIODE_BIAS</name>
                <description>TBD - Currently not used</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PGA_BW_BOOST_EN</name>
                <description>TBD - Currently not used</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MOD_CTL</name>
            <description>Modulator Control</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xC003236</resetValue>
            <resetMask>0xF007377</resetMask>
            <fields>
              <field>
                <name>POWER1</name>
                <description>First stage Opamp power level control</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>POWER1_44uA</name>
                    <description>10 percent Power Mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER1_135uA</name>
                    <description>31 percent Power Mode</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER1_190uA</name>
                    <description>44 percent Power Mode</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER1_271uA</name>
                    <description>63 percent Power Mode</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER1_325uA</name>
                    <description>75 percent Power Mode</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER1_380uA</name>
                    <description>88 percent Power Mode</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER1_433uA</name>
                    <description>100 percent Power Mode</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER1_652uA</name>
                    <description>150 percent Power Mode</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>POWER2_3</name>
                <description>The power control for the second and third integrator stages</description>
                <bitRange>[6:4]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>POWER2_3_97uA</name>
                    <description>75 percent Power Mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER2_3_106uA</name>
                    <description>81 percent Power Mode</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER2_3_122uA</name>
                    <description>94 percent Power Mode</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER2_3_130uA</name>
                    <description>100 percent Power Mode</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER2_3_193uA</name>
                    <description>150 percent Power Mode</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER2_3_130uA_2</name>
                    <description>100 percent Power Mode</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER2_3_130uA_3</name>
                    <description>100 percent Power Mode</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER2_3_130uA_4</name>
                    <description>100 percent Power Mode</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>POWER_COMP</name>
                <description>The power control for the quantizer block</description>
                <bitRange>[9:8]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>POWER_COMP_50</name>
                    <description>50 percent Power Mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER_COMP_75</name>
                    <description>75 percent Power Mode</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER_COMP_100</name>
                    <description>100 percent Power Mode</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER_COMP_200</name>
                    <description>200 percent Power Mode</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>POWER_SUM</name>
                <description>The power control for the summer block</description>
                <bitRange>[14:12]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>POWER_SUM_53uA</name>
                    <description>75 percent Power Mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER_SUM_58uA</name>
                    <description>81 percent Power Mode</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER_SUM_67uA</name>
                    <description>94 percent Power Mode</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER_SUM_71uA</name>
                    <description>100 percent Power Mode</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER_SUM_105uA</name>
                    <description>150 percent Power Mode</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER_SUM_71uA_2</name>
                    <description>N/A</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER_SUM_71uA_3</name>
                    <description>N/A</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER_SUM_71uA_4</name>
                    <description>N/A</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MOD_FCHOP</name>
                <description>Modulator Chopping Clock Frequency Selection</description>
                <bitRange>[26:24]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FCLOCKDIV2</name>
                    <description>chopping frequency is Fclock/2</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV4</name>
                    <description>chopping frequency is Fclock/4</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV8</name>
                    <description>chopping frequency is Fclock/8</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV16</name>
                    <description>chopping frequency is Fclock/16</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV32</name>
                    <description>chopping frequency is Fclock/32</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV64</name>
                    <description>chopping frequency is Fclock/64</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV128</name>
                    <description>chopping frequency is Fclock/128</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV256</name>
                    <description>chopping frequency is Fclock/256</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MOD_CHOP_EN</name>
                <description>Modulator Chopping Enable</description>
                <bitRange>[27:27]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DPATH_CTL</name>
            <description>Datapath Control</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xC0002</resetValue>
            <resetMask>0x137F7F0F</resetMask>
            <fields>
              <field>
                <name>QLEV</name>
                <description>N/A</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>NONOV</name>
                <description>Non-Overlap delay of clock phases

