zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hv144k.svd
Also known as EN_ADWA</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCRAM1_EN</name>
                <description>Enable Scrambler 1

Also known as EN_BIDWA</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DEM_EN</name>
                <description>Enable DEM

Bi-directional Data Weighted Averaging (DWA) based Dynamic Element Matching  (DEM) scheme for mismatch cancellation. Bi-directional DWA alters the direction of pointers used for rotation every cycle for avoiding repetition pattern of the DWA for low value DC inputs.

DWA mode:  SCRAM0_EN=0, SCRAM1_EN=0
Alternate DWA mode (not preferred): SCRAM0_EN=1, SCRAM1_EN=0
Bi-DWA mode: SCRAM0_EN=0, SCRAM1_EN=1
Not used: SCRAM0_EN=1, SCRAM1_EN=1</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SWITCH</name>
            <description>Firmware Switch Control</description>
            <addressOffset>0x34</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>INMUX_ABUSA_VPLUS</name>
                <description>Firmware control: 0=open, 1=close switch between VPLUS and AMUXBUSA output. Write with '1' to set bit. This switch can be closed while the sequencer is controls the INMUX pin selection</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INMUX_ABUSB_VPLUS</name>
                <description>Firmware control: 0=open, 1=close switch between VPLUS and AMUXBUSB. Write with '1' to set bit. This switch can be closed while the sequencer is controls the INMUX pin selection</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INMUX_ABUSA_VMINUS</name>
                <description>Firmware control: 0=open, 1=close switch between VMINUS and AMUXBUSA output. Write with '1' to set bit. This switch can be closed while the sequencer is controls the INMUX pin selection</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INMUX_ABUSB_VMINUS</name>
                <description>Firmware control: 0=open, 1=close switch between VMINUS and AMUXBUSB. Write with '1' to set bit. This switch can be closed while the sequencer is controls the INMUX pin selection</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AAF_SW1</name>
                <description>Firmware control: 0=open, 1=close AAF switch 1. Write with '1' to set bit. This switch can only be closed via this register if SWITCH_SQ_CTL.AAF=0</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AAF_SW2</name>
                <description>Firmware control: 0=open, 1=close AAF switch 2. Write with '1' to set bit. This switch can only be closed via this register if SWITCH_SQ_CTL.AAF=0</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AAF_SW3</name>
                <description>Firmware control: 0=open, 1=close AAF switch 3. Write with '1' to set bit. This switch can only be closed via this register if SWITCH_SQ_CTL.AAF=0.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AAF_SW4</name>
                <description>Firmware control: 0=open, 1=close AAF switch 4. Write with '1' to set bit. This switch can only be closed via this register if SWITCH_SQ_CTL.AAF=0</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SWITCH_CLEAR</name>
            <description>Firmware Switch Control Clear</description>
            <addressOffset>0x38</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>INMUX_ABUSA_VPLUS</name>
                <description>Write '1' to clear corresponding bit in the SWITCH register</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INMUX_ABUSB_VPLUS</name>
                <description>Write '1' to clear corresponding bit in the SWITCH register</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INMUX_ABUSA_VMINUS</name>
                <description>Write '1' to clear corresponding bit in the SWITCH register</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INMUX_ABUSB_VMINUS</name>
                <description>Write '1' to clear corresponding bit in the SWITCH register</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AAF_SW1</name>
                <description>Write '1' to clear corresponding bit in the SWITCH register</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AAF_SW2</name>
                <description>Write '1' to clear corresponding bit in the SWITCH register</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AAF_SW3</name>
                <description>Write '1' to clear corresponding bit in the SWITCH register</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AAF_SW4</name>
                <description>Write '1' to clear corresponding bit in the SWITCH register</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SWITCH_SQ_CTL</name>
            <description>Switch Sequencer Control</description>
            <addressOffset>0x3C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x11</resetValue>
            <resetMask>0x11</resetMask>
            <fields>
              <field>
                <name>INMUX</name>
                <description>Allow sequencer control for the provided switches</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AAF</name>
                <description>Allow sequencer control for the provided switches</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SWITCH_STATUS</name>
            <description>Switch Status</description>
            <addressOffset>0x40</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x90</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>INMUX_ABUSA_VPLUS</name>
                <description>switch status of corresponding bit in the SWITCH register</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>INMUX_ABUSB_VPLUS</name>
                <description>switch status of corresponding bit in the SWITCH register</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>INMUX_ABUSA_VMINUS</name>
                <description>switch status of corresponding bit in the SWITCH register</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>INMUX_ABUSB_VMINUS</name>
                <description>switch status of corresponding bit in the SWITCH register</description>
                <bitRange>[3:3]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AAF_SW1</name>
                <description>switch status of corresponding bit in the SWITCH register</description>
                <bitRange>[4:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AAF_SW2</name>
                <description>switch status of corresponding bit in the SWITCH register</description>
                <bitRange>[5:5]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AAF_SW3</name>
                <description>switch status of corresponding bit in the SWITCH register</description>
                <bitRange>[6:6]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AAF_SW4</name>
                <description>switch status of corresponding bit in the SWITCH register</description>
                <bitRange>[7:7]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DFT_CTL</name>
            <description>DFT Control Register</description>
            <addressOffset>0x44</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1FF30F7</resetMask>
            <fields>
              <field>
                <name>MUXA_SEL</name>
                <description>DFT MUX Selection for AMUXBUSA</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VCCA_DSM_DFT_KELVIN</name>
                    <description>dft_out = vcca_dsm_dft_kelvin</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VCM</name>
                    <description>dft_out = vcm</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREF_DAC</name>
                    <description>dft_out = vref_dac</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AAF_IN_P</name>
                    <description>dft_out = aaf_in_p</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IREF_4P8U</name>
                    <description>dft_out = iref_4p8u  - current source of PGA top amp cascode device</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BUFFIN_VPLUS</name>
                    <description>dft_out = buffin_vplus</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BUFFIN_VMINUS</name>
                    <description>dft_out = buffin_vminus</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BUFOUT_VPLUS</name>
                    <description>dft_out = bufout_vplus</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MUXB_SEL</name>
                <description>DFT MUX Selection for AMUXBUSB</description>
                <bitRange>[6:4]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VCCA_DSM_DFT</name>
                    <description>dft_out = vcca_dsm_dft</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REFOUT</name>
                    <description>dft_out = refout</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREF_QTZ</name>
                    <description>dft_out = vref_qtz</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AAF_IN_N</name>
                    <description>dft_out = aaf_in_n</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IREF_2P4U</name>
                    <description>dft_out = iref_2p4u  - current source of buffer top amp cascode device</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BUFFIN_VMINUS</name>
                    <description>dft_out = buffin_vminus</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BUFFIN_VPLUS</name>
                    <description>dft_out = buffin_vplus</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BUFOUT_VMINUS</name>
                    <description>dft_out = bufout_vminus</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MUX_EN</name>
                <description>DFT MUX Enable</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PGA_TEST_EN</name>
                <description>PGA Test Mode</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VNEG_PMP_TEST_EN</name>
                <description>Negative Pump Test Enable</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FRC_ANA_EN_LOW</name>
                <description>Force global analog enable low (enable_scanoff_hv) to test for any SA1 faults on the level-shifter enables.</description>
                <bitRange>[16:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RS0_PULLDOWN</name>
                <description>RS0 Pull-down. Enables pull down on RSH0/RSL0 input pair for offset calibration.</description>
                <bitRange>[17:17]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RS1_PULLDOWN</name>
                <description>RS1 Pull-down. Enables pull down on RSH1/RSL1 input pair for offset calibration.</description>
                <bitRange>[18:18]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CHOP_PHASE_CTL</name>
                <description>Circuit chopping phase control. Inverts circuit chopping phase</description>
                <bitRange>[19:19]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SPARE_CTL</name>
                <description>Spare MMIO Controls for analog</description>
                <bitRange>[24:20]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DFT_STATUS</name>
            <description>DFT Status Register</description>
            <addressOffset>0x48</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>OBSVR_LS_OUT</name>
                <description>Observation point of level-shifters output. Used for detection of SA1 faults on the level-shifter enables. The read back value of this register changes based on the configuration and trims of the ACHAN and PACSS_MMIO registers.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_PGA0_CTL</name>
            <description>PGA Trim 0 (lock protected)</description>
            <addressOffset>0xFF00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>OFST_P</name>
                <description>Offset Plus Trim</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_PGA1_CTL</name>
            <description>PGA Trim 1 (lock protected)</description>
            <addressOffset>0xFF04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>OFST_SLOPE_P</name>
                <description>Offset Slope Plus Trim</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_PGA2_CTL</name>
            <description>PGA Trim 2 (lock protected)</description>
            <addressOffset>0xFF08</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>OFST_M</name>
                <description>Offset Minus Trim</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_PGA3_CTL</name>
            <description>PGA Trim 3 (lock protected)</description>
            <addressOffset>0xFF0C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>OFST_SLOPE_M</name>
                <description>Offset Slope Minus Trim</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_PGA4_CTL</name>
            <description>PGA Trim 4 (lock protected)</description>
            <addressOffset>0xFF10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x4</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>CM</name>
                <description>Common Mode  (Output Range) Trim</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_BUF0_CTL</name>
            <description>Buffer Trim 0 (lock protected)</description>
            <addressOffset>0xFF14</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>OFST_P</name>
                <description>Offset Plus Trim</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_BUF1_CTL</name>
            <description>Buffer Trim 1 (lock protected)</description>
            <addressOffset>0xFF18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>OFST_PTAT_P</name>
                <description>Offset PTAT Plus Trim</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_BUF2_CTL</name>
            <description>Buffer Trim 2 (lock protected)</description>
            <addressOffset>0xFF1C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>OFST_M</name>
                <description>Offset Minus Trim</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_BUF3_CTL</name>
            <description>Buffer Trim 3 (lock protected)</description>
            <addressOffset>0xFF20</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>OFST_PTAT_M</name>
                <description>Offset PTAT Minus Trim</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
