zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hv144k.svd
        <cluster>
          <name>MMIO</name>
          <description>PACSS Global MMIO</description>
          <addressOffset>0x000F0000</addressOffset>
          <register>
            <name>PACSS_CTL</name>
            <description>Precision Analog Channel Control</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x800003FF</resetMask>
            <fields>
              <field>
                <name>AGC_EN</name>
                <description>Auto-Gain Correction Enable</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LDO_EN</name>
                <description>Low Dropout Regulator Enable

Enables modulator voltage supply</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TMPS_EN</name>
                <description>Temperature Sensor Enable</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AREF_EN</name>
                <description>AREF Enable</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HPBGR_EN</name>
                <description>High Precision Bandgap Reference Enable</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VPOS_PMP_EN</name>
                <description>Positive Pump Enable</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OCD0_EN</name>
                <description>Over Current Detection  0 Enable</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OCD1_EN</name>
                <description>Over Current Detection 1  Enable</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HVDIVG_MUX_SEL</name>
                <description>High Voltage Divider Ground Reference Mux Select

0 - Select VSSA
1 - Select VSSA
2 - Select RSH[0]
3 - Select RSL[0]

This field is not applicable if VDIAG pin is not a package pin, in which case the selection is forced to VSSA regardless of how this field is set.</description>
                <bitRange>[9:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Global Enable</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AGC_CTL0</name>
            <description>Auto-Gain Correction Control 0</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x7003010</resetValue>
            <resetMask>0x3FFFFFFF</resetMask>
            <fields>
              <field>
                <name>LO_THRESH</name>
                <description>Low Threshold value

Magnitude of lower threshold value.  This is an absolute value comparison. If the fast decimator result is lower than this threshold value, the gain level will be incremented. Gain levels must be configured from lowest to highest gain. 

modulator output ranges from -4 to 4. The max value will be 4* (FAST_DR+1)
Based on default values: 4*16 = 64, default is 25 percent (16=0x10)


Ex: set to  0x20 to set to -32 (decimal) or 32 (decimal)</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HI_THRESH</name>
                <description>High Threshold value

Magnitude of high threshold value. This is an absolute value comparison. If the fast decimator result is higher than this threshold value, the gain level will be decremented. Gain levels must be configured from lowest to highest gain.

modulator output ranges from -4 to 4. The max value will be 4* (FAST_DR+1)
Based on default values: 4*16 = 64, default is 75 percent (48=0x30)

Ex: set 0x64 to set to -100 (decimal) or 100 (decimal)</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INIT_LVL</name>
                <description>Initial Gain level 

The gain level that the AGC is initialized to once a conversion starts. Acceptable values are 0 - 9.</description>
                <bitRange>[19:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MIN_LVL</name>
                <description>Minimum Gain Level

The minimum gain level the AGC is allowed to reach when decrementing. 
Acceptable values are  0 - 9, but MIN_LVL &lt;=  INIT_LVL  &lt;= MAX_LVL</description>
                <bitRange>[23:20]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MAX_LVL</name>
                <description>Maximum Gain level

The maximum gain level that the AGC is allowed to reach when incrementing

Acceptable values are 0 - 9,  but MIN_LVL &lt;=  INIT_LVL  &lt;= MAX_LVL</description>
                <bitRange>[27:24]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FAST_DEC_SCLR</name>
                <description>Fast Decimator Scaler

Used to apply digital gain to output of the AGC's fast decimator. Intended to be used when digital gain is applied to the system via moving sum.

0 : FAST_DEC_RESULT = RESULT 
1 : FAST_DEC_RESULT = RESULT &lt;&lt; 1
2 : FAST_DEC_RESULT = RESULT &lt;&lt; 2
3 : FAST_DEC_RESULT  = RESULT &lt;&lt; 3</description>
                <bitRange>[29:28]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AGC_CTL1</name>
            <description>Auto-Gain Correction Control 1</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x700000F</resetValue>
            <resetMask>0xFFFFFF9F</resetMask>
            <fields>
              <field>
                <name>FAST_DR</name>
                <description>Fast Decimator Decimation Ratio

(FAST_DR+1) sets the decimation ratio for the AGC's Fast Decimator

The fast decimator will run continuously with this FAST_DR value while the DCHAN0 decimator is running.</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AAF_BLANK_MODE</name>
                <description>Anti-Aliasing Filter (AAF) Blanking Mode

