zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hv144k.svd
            <register>
              <name>GAIN_CFG1</name>
              <description>Gain configuration register 1</description>
              <addressOffset>0x4</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xF7771F</resetMask>
              <fields>
                <field>
                  <name>SUMCAPIN</name>
                  <description>The summer capacitance that lies on the path where the input signal is summed</description>
                  <bitRange>[4:0]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SUMCAPIN_50fF</name>
                      <description>50fF</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_100fF</name>
                      <description>100fF</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_150fF</name>
                      <description>150fF</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_200fF</name>
                      <description>200fF</description>
                      <value>3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_250fF</name>
                      <description>250fF</description>
                      <value>4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_300fF</name>
                      <description>300fF</description>
                      <value>5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_350fF</name>
                      <description>350fF</description>
                      <value>6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_400fF</name>
                      <description>400fF</description>
                      <value>7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_450fF</name>
                      <description>450fF</description>
                      <value>8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_500fF</name>
                      <description>500fF</description>
                      <value>9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_550fF</name>
                      <description>550fF</description>
                      <value>10</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_600fF</name>
                      <description>600fF</description>
                      <value>11</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_650fF</name>
                      <description>650fF</description>
                      <value>12</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_700fF</name>
                      <description>700fF</description>
                      <value>13</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_750fF</name>
                      <description>750fF</description>
                      <value>14</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_800fF</name>
                      <description>800fF</description>
                      <value>15</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_850fF</name>
                      <description>850fF</description>
                      <value>16</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_900fF</name>
                      <description>900fF</description>
                      <value>17</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_950fF</name>
                      <description>950fF</description>
                      <value>18</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_1000fF</name>
                      <description>1000fF</description>
                      <value>19</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_1050fF</name>
                      <description>1050fF</description>
                      <value>20</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_1100fF</name>
                      <description>1100fF</description>
                      <value>21</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_1150fF</name>
                      <description>1150fF</description>
                      <value>22</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_1200fF</name>
                      <description>1200fF</description>
                      <value>23</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_1250fF</name>
                      <description>1250fF</description>
                      <value>24</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_1300fF</name>
                      <description>1300fF</description>
                      <value>25</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_1350fF</name>
                      <description>1350fF</description>
                      <value>26</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_1400fF</name>
                      <description>1400fF</description>
                      <value>27</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_1450fF</name>
                      <description>1450fF</description>
                      <value>28</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_1500fF</name>
                      <description>1500fF</description>
                      <value>29</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_1550fF</name>
                      <description>1550fF</description>
                      <value>30</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPIN_1600fF</name>
                      <description>1600fF</description>
                      <value>31</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SUMCAP1</name>
                  <description>The summer capacitance that lies on the feed-forward path from the first integrator output</description>
                  <bitRange>[10:8]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SUMCAP1_50fF</name>
                      <description>50fF</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP1_100fF</name>
                      <description>100fF</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP1_150fF</name>
                      <description>150fF</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP1_200fF</name>
                      <description>200fF</description>
                      <value>3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP1_250fF</name>
                      <description>250fF</description>
                      <value>4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP1_300fF</name>
                      <description>300fF</description>
                      <value>5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP1_350fF</name>
                      <description>350fF</description>
                      <value>6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP1_400fF</name>
                      <description>400fF</description>
                      <value>7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SUMCAP2</name>
                  <description>The summer capacitance that lies on the feed-forward path from the second integrator output</description>
                  <bitRange>[14:12]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SUMCAP2_50fF</name>
                      <description>50fF</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP2_100fF</name>
                      <description>100fF</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP2_150fF</name>
                      <description>150fF</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP2_200fF</name>
                      <description>200fF</description>
                      <value>3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP2_250fF</name>
                      <description>250fF</description>
                      <value>4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP2_300fF</name>
                      <description>300fF</description>
                      <value>5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP2_350fF</name>
                      <description>350fF</description>
                      <value>6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP2_400fF</name>
                      <description>400fF</description>
                      <value>7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SUMCAP3</name>
                  <description>The summer capacitance that lies on the feed-forward path from the third integrator output</description>
                  <bitRange>[18:16]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SUMCAP3_50fF</name>
                      <description>50fF</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP3_100fF</name>
                      <description>100fF</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP3_150fF</name>
                      <description>150fF</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP3_200fF</name>
                      <description>200fF</description>
                      <value>3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP3_250fF</name>
                      <description>250fF</description>
                      <value>4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP3_300fF</name>
                      <description>300fF</description>
                      <value>5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP3_350fF</name>
                      <description>350fF</description>
                      <value>6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAP3_400fF</name>
                      <description>400fF</description>
                      <value>7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SUMCAPFB</name>
                  <description>The summer feedback capacitance</description>
                  <bitRange>[23:20]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SUMCAPFB_50fF</name>
                      <description>50fF</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPFB_100fF</name>
                      <description>100fF</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPFB_150fF</name>
                      <description>150fF</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPFB_200fF</name>
                      <description>200fF</description>
                      <value>3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPFB_250fF</name>
                      <description>250fF</description>
                      <value>4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPFB_300fF</name>
                      <description>300fF</description>
                      <value>5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPFB_350fF</name>
                      <description>350fF</description>
                      <value>6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPFB_400fF</name>
                      <description>400fF</description>
                      <value>7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPFB_450fF</name>
                      <description>450fF</description>
                      <value>8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPFB_500fF</name>
                      <description>500fF</description>
                      <value>9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPFB_550fF</name>
                      <description>550fF</description>
                      <value>10</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPFB_600fF</name>
                      <description>600fF</description>
                      <value>11</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPFB_650fF</name>
                      <description>650fF</description>
                      <value>12</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPFB_700fF</name>
                      <description>700fF</description>
                      <value>13</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPFB_750fF</name>
                      <description>750fF</description>
                      <value>14</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SUMCAPFB_800fF</name>
                      <description>800fF</description>
                      <value>15</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>OFST_COR</name>
              <description>Offset Correction register</description>
              <addressOffset>0x8</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFFFF</resetMask>
              <fields>
                <field>
                  <name>OCOR</name>
                  <description>Decimator Offset Correction Coefficient

See DCHAN.OCOR_COR for description details</description>
                  <bitRange>[15:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>GAIN_COR</name>
              <description>Gain Correction register</description>
              <addressOffset>0xC</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFFFF</resetMask>
              <fields>
                <field>
                  <name>GCOR</name>
                  <description>Decimator Gain Correction Coefficient

See DCHAN.GAIN_COR for description details</description>
                  <bitRange>[15:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>HPBGR_CTL</name>
            <description>High Precision Bandgap Reference Control</description>
            <addressOffset>0x500</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x200</resetValue>
            <resetMask>0x717</resetMask>
            <fields>
              <field>
                <name>CHOP_EN</name>
                <description>HPBGR Chopping Enable (1: enable, 0: disable)

ACHAN0 must be enabled, along with ACHAN0.ACHAN_CTL.MOD_EN for this bit to take affect. Setting this bit also enables a free running clock to the ACHAN0's modulator. 

This bit should be set to 1 by SW in the default use case.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CHOP_CLK_SEL</name>
                <description>Bgr core chopping phase select input (0: normal phase, 1: reverse phase)</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CHOP_POS</name>
                <description>Chopping position select (0: normal phase, 1: reverse phase. Applies to output buffer and BGR core; BGR core is also affected by CHOP_CLK_SEL). Only applies when CHOP_EN=0.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SEL_PHC</name>
                <description>Buffer phase compensation option for external capacitor 
(0: cap present, 1: cap absent)</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HPBGR_FCHOP</name>
                <description>High Precision Bandgap Reference Chopping Clock Frequency selection</description>
                <bitRange>[10:8]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FCLOCKDIV2</name>
                    <description>Fclock/2</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV4</name>
                    <description>Fclock/4</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV8</name>
                    <description>Fclock/8</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV16</name>
                    <description>Fclock/16</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV32</name>
                    <description>Fclock/32</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV64</name>
                    <description>Fclock/64</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV128</name>
                    <description>Fclock/128</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCLOCKDIV256</name>
                    <description>Fclock/256</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
