zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hv144k.svd
          <register>
            <name>HPBGR_DFT_CTL</name>
            <description>High Precision Bandgap Reference DFT Control</description>
            <addressOffset>0x510</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>ADFT_MODE</name>
                <description>N/A</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AREF_CTL</name>
            <description>Analog Reference Control</description>
            <addressOffset>0x600</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>LP_MODE</name>
                <description>Low Power Mode 

     0 - Full power, all currents available
     1 - No 2.4uA currents available, others are available

AREF automatically enters low power mode when the device is DeepSleep, this bit can be used to enter low power mode when the device is in Active mode.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AREF_DFT_CTL</name>
            <description>Analog Reference DFT Control</description>
            <addressOffset>0x610</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x713F17</resetMask>
            <fields>
              <field>
                <name>DFT_SOURCE</name>
                <description>N/A</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DFT_SUM</name>
                <description>DFT outputs sum (0: Single currents to ADFT, 1: Sum of all currents of type selected by DFT_SOURCE are sent to ADFT)</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DFT_CURR_SEL</name>
                <description>Selects which single current from DFT_SOURCE type to send to ADFT. (0: first current, 1: second current, etc, to max of available currents)</description>
                <bitRange>[11:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DFT_RSEL</name>
                <description>DFT Resistor Select

For applying an internal pulldown resistor on the current output to amuxbus. When the pulldown is activated, both amuxbus_a and amuxbus_b connect to the resistor, allowing for kelvin connection to measure the resistor.

0 - No resistor (current output only)
1 - 10k resistor pulldown
2 - 200k resistor pulldown
3 - 1.2M resistor pulldown</description>
                <bitRange>[13:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DFT_OUT_SEL</name>
                <description>ADFT output select (0: to amuxbusa, 1: to amuxbusb)</description>
                <bitRange>[16:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AREF_SPARE</name>
                <description>N/A</description>
                <bitRange>[22:20]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>REG_PROT</name>
            <description>Register Protection</description>
            <addressOffset>0x800</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xF08169E7</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MAGIC</name>
                <description>Setting this register to the value 0xf08169e7 unlocks access to Lock Protected Registers. These registers can not be written to unless this value has been written into this register. Writing a value OTHER than the magic key will disable access to the registers. The register POR value is set to 'unlock' the register access.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PDFT_CTL</name>
            <description>PACSS DFT Control</description>
            <addressOffset>0x900</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x300FF</resetMask>
            <fields>
              <field>
                <name>DDFT0_MUX_SEL</name>
                <description>N/A</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DDFT1_MUX_SEL</name>
                <description>N/A</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LDO_BYPASS</name>
                <description>N/A</description>
                <bitRange>[16:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VPOS_PMP_TEST_EN</name>
                <description>Positive Pump Test Enable</description>
                <bitRange>[17:17]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_REGL0_CTL</name>
            <description>Regulator (LDO) Trim 0 (lock protected)</description>
            <addressOffset>0xFF00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x17</resetMask>
            <fields>
              <field>
                <name>FINE</name>
                <description>Fine Trim</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>COARSE</name>
                <description>Coarse Trim</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_HPBGR0_CTL</name>
            <description>High Precision Bandgap Reference Trim Control 0 (lock protected)</description>
            <addressOffset>0xFF04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x80</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>VREF_OS</name>
                <description>Offset trim for HPBGR 1.2V output</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_HPBGR1_CTL</name>
            <description>High Precision Bandgap Reference Trim Control 1 (lock protected)</description>
            <addressOffset>0xFF08</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x40</resetValue>
            <resetMask>0x7F</resetMask>
            <fields>
              <field>
                <name>VREF_TC</name>
                <description>First order temp-co correction trim</description>
                <bitRange>[6:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_HPBGR2_CTL</name>
            <description>High Precision Bandgap Reference Trim Control 2 (lock protected)</description>
            <addressOffset>0xFF0C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x88</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>VREF_NL1</name>
                <description>Low temperature second order temp-co correction trim</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VREF_NL2</name>
                <description>High temperature second order temp-co correction trim</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_HPBGR3_CTL</name>
            <description>High Precision Bandgap Reference Trim Control 3 (lock protected)</description>
            <addressOffset>0xFF10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x90</resetValue>
            <resetMask>0x9F</resetMask>
            <fields>
              <field>
                <name>VREF_AMP</name>
                <description>Chopping amplifier trim</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>NL_COREC_DIS</name>
                <description>Second order temp-co correction enable (0: correction, 1: no correction)</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_HPBGR4_CTL</name>
            <description>High Precision Bandgap Reference Trim Control 4 (lock protected)</description>
            <addressOffset>0xFF14</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>NL1TEMP</name>
                <description>Non-linearity Temperature Trim 1</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>NL1GAIN</name>
                <description>Non-linearity Gain Trim 1</description>
                <bitRange>[3:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>NL2TEMP</name>
                <description>Non-linearity Temperature Trim 2</description>
                <bitRange>[5:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>NL2GAIN</name>
                <description>Non-linearity Gain Trim 2</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_AREF0_CTL</name>
            <description>Analog Reference Trim Control 0 (lock protected)</description>
            <addressOffset>0xFF18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1F</resetMask>
            <fields>
              <field>
                <name>ICTAT</name>
                <description>Trim for AREF CTAT currents</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_AREF1_CTL</name>
            <description>Analog Reference Trim Control 1 (lock protected)</description>
            <addressOffset>0xFF1C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>IPTAT_COARSE</name>
                <description>Coarse Trim for AREF PTAT currents</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_AREF2_CTL</name>
            <description>Analog Reference Trim Control 2 (lock protected)</description>
            <addressOffset>0xFF20</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1F</resetMask>
            <fields>
              <field>
                <name>IPTAT_FINE</name>
                <description>Fine Trim for AREF PTAT currents</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_AREF3_CTL</name>
            <description>Analog Reference Trim Control 3 (lock protected)</description>
            <addressOffset>0xFF24</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>PTAT_DAC</name>
                <description>Trim for AREF PTAT DAC</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_AREF4_CTL</name>
            <description>Analog Reference Trim Control 4 (lock protected)</description>
            <addressOffset>0xFF28</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>ZTAT_COARSE</name>
                <description>Coarse Trim for AREF ZTAT</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_AREF5_CTL</name>
            <description>Analog Reference Trim Control 5 (lock protected)</description>
            <addressOffset>0xFF2C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1F</resetMask>
            <fields>
              <field>
                <name>ZTAT_FINE</name>
                <description>Fine Trim for AREF ZTAT
Only bits [3:0] are functional.  Bit 4 is a spare bit.</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_AREF6_CTL</name>
            <description>Analog Reference Trim Control 6 (lock protected)</description>
            <addressOffset>0xFF30</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>CTAT_COARSE</name>
                <description>Coarse Trim for AREF CTAT</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_OCD00_CTL</name>
            <description>Trim Control 0 for Over Current Detector 0 (lock protected)</description>
            <addressOffset>0xFF34</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>TRIM0</name>
                <description>N/A</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_OCD01_CTL</name>
            <description>Trim Control 0 for Over Current Detector 1 (lock protected)</description>
            <addressOffset>0xFF38</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>TRIM1</name>
                <description>N/A</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_OCD10_CTL</name>
            <description>Trim Control 1 for Over Current Detector 0 (lock protected))</description>
            <addressOffset>0xFF3C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>TRIM0</name>
                <description>N/A</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIM_OCD11_CTL</name>
            <description>Trim Control 1 for Over Current Detector 1 (lock protected)</description>
            <addressOffset>0xFF40</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>TRIM1</name>
                <description>N/A</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
  </peripherals>
</device>